Repository: Shohjahon-n/suv_kerak_courier
Catalog: lib/l10n/app_*.arb
Languages: ru, uz_cyrl, uz_latn

# cashReportRetry
source: Retry
ru: Повторить
uz_cyrl: Қайта уриниб кўриш
uz_latn: Qayta urinib ko'rish

# cashReportSessionMissing
source: Courier session not found.
ru: Сессия курьера не найдена.
uz_cyrl: Курер сессияси топилмади.
uz_latn: Kuryer sessiyasi topilmadi.

# cashReportSummaryTitle
source: Summary
ru: Сводка
uz_cyrl: Якун
uz_latn: Yakun

# cashReportOpeningBalanceLabel
source: Opening balance
ru: Начальный остаток
uz_cyrl: Бошланғич салдо
uz_latn: Boshlang'ich saldo

# cashReportClosingBalanceLabel
source: Closing balance
ru: Конечный остаток
uz_cyrl: Якуний салдо
uz_latn: Yakuniy saldo

# cashReportTotalIncomeLabel
source: Total income
ru: Всего поступлений
uz_cyrl: Жами кирим
uz_latn: Jami kirim

# cashReportTotalExpenseLabel
source: Total expense
ru: Всего расходов
uz_cyrl: Жами чиқим
uz_latn: Jami chiqim

# cashReportOperationsTitle
source: Operations
ru: Операции
uz_cyrl: Операциялар
uz_latn: Operatsiyalar

# cashReportIncomeLabel
source: Income
ru: Поступление
uz_cyrl: Кирим
uz_latn: Kirim

# cashReportExpenseLabel
source: Expense
ru: Расход
uz_cyrl: Чиқим
uz_latn: Chiqim

# cashReportBalanceLabel
source: Balance
ru: Баланс
uz_cyrl: Баланс
uz_latn: Balans

# cashReportTotalAmountLabel
source: Total amount
ru: Общая сумма
uz_cyrl: Жами сумма
uz_latn: Jami summa

# cashReportPaymentsTitle
source: Payments
ru: Платежи
uz_cyrl: Тўловлар
uz_latn: To'lovlar

# cashReportOrderLabel
source: Order
ru: Заказ
uz_cyrl: Буюртма
uz_latn: Buyurtma

# cashReportBuyerLabel
source: Buyer
ru: Покупатель
uz_cyrl: Буюртмачи
uz_latn: Buyurtmachi

# cashReportPaymentSystemLabel
source: Payment system
ru: Платежная система
uz_cyrl: Тўлов тизими
uz_latn: To'lov tizimi

# cashReportAmountLabel
source: Amount
ru: Сумма
uz_cyrl: Сумма
uz_latn: Summa

# themeModeTitle
source: Theme mode
ru: Тема
uz_cyrl: Мавзу
uz_latn: Mavzu

# themeModeLight
source: Light
ru: Светлая
uz_cyrl: Ёруғ
uz_latn: Yorug'

# themeModeDark
source: Dark
ru: Темная
uz_cyrl: Қоронғи
uz_latn: Qorong'i

# logoutButton
source: Log out
ru: Выйти из профиля
uz_cyrl: Профилдан чиқиш
uz_latn: Profildan chiqish

# securityTitle
source: Security
ru: Безопасность
uz_cyrl: Хавфсизлик
uz_latn: Xavfsizlik

# securityPinTitle
source: PIN code login
ru: Вход по PIN-коду
uz_cyrl: PIN код орқали кириш
uz_latn: PIN kod orqali kirish

# securityBiometricTitle
source: Biometric login
ru: Вход по биометрии
uz_cyrl: Биометрик кириш
uz_latn: Biometrik kirish

# securityChangePasswordTitle
source: Change password
ru: Сменить пароль
uz_cyrl: Паролни алмаштириш
uz_latn: Parolni almashtirish

# securityChangePinTitle
source: Change PIN
ru: Сменить PIN-код
uz_cyrl: PIN кодни алмаштириш
uz_latn: PIN kodni almashtirish

# securityOldPasswordLabel
source: Current password
ru: Текущий пароль
uz_cyrl: Эски парол
uz_latn: Eski parol

# securityNewPasswordLabel
source: New password
ru: Новый пароль
uz_cyrl: Янги парол
uz_latn: Yangi parol

# securityConfirmPasswordLabel
source: Confirm password
ru: Подтвердите пароль
uz_cyrl: Янги паролни тасдиқлаш
uz_latn: Yangi parolni tasdiqlash

# securityOldPinLabel
source: Current PIN
ru: Текущий PIN
uz_cyrl: Эски PIN
uz_latn: Eski PIN

# securityNewPinLabel
source: New PIN
ru: Новый PIN
uz_cyrl: Янги PIN
uz_latn: Yangi PIN

# securityConfirmPinLabel
source: Confirm PIN
ru: Подтвердите PIN
uz_cyrl: Янги PINни тасдиқлаш
uz_latn: Yangi PINni tasdiqlash

# securityUpdateButton
source: Update
ru: Обновить
uz_cyrl: Янгилаш
uz_latn: Yangilash

# securityValidationRequired
source: Fill out all fields.
ru: Заполните все поля.
uz_cyrl: Барча майдонларни тўлдиринг.
uz_latn: Barcha maydonlarni to'ldiring.

# securityValidationMismatch
source: New values do not match.
ru: Новые значения не совпадают.
uz_cyrl: Янги қийматлар мос эмас.
uz_latn: Yangi qiymatlar mos emas.

# securityApiNotReady
source: API is not connected yet.
ru: API еще не подключен.
uz_cyrl: API ҳали уланмаган.
uz_latn: API hali ulanmagan.

# securitySessionMissing
source: Courier session not found.
ru: Сессия курьера не найдена.
uz_cyrl: Курер сессияси топилмади.
uz_latn: Kuryer sessiyasi topilmadi.

# securityPasswordUpdated
source: Password updated successfully.
ru: Пароль успешно обновлен.
uz_cyrl: Парол муваффақиятли янгиланди.
uz_latn: Parol muvaffaqiyatli yangilandi.

# securityPasswordUpdateFailed
source: Password update failed.
ru: Не удалось обновить пароль.
uz_cyrl: Паролни янгилаб бўлмади.
uz_latn: Parolni yangilashda xatolik.

# securityPinUpdated
source: PIN updated successfully.
ru: PIN успешно обновлен.
uz_cyrl: PIN муваффақиятли янгиланди.
uz_latn: PIN muvaffaqiyatli yangilandi.

# securityPinUpdateFailed
source: PIN update failed.
ru: Не удалось обновить PIN.
uz_cyrl: PINни янгилаб бўлмади.
uz_latn: PINni yangilashda xatolik.

# pinSetupTitle
source: Create PIN
ru: Создать PIN
uz_cyrl: PIN танланг
uz_latn: PIN tanlang

# pinSetupSubtitle
source: Choose a 4-digit PIN.
ru: Выберите PIN из 4 цифр.
uz_cyrl: 4 хонали PIN танланг.
uz_latn: 4 xonali PIN tanlang.

# pinSetupConfirmLabel
source: Confirm PIN
ru: Повторите PIN
uz_cyrl: PIN ни тасдиқланг
uz_latn: PIN ni tasdiqlang

# pinSetupSave
source: Save
ru: Сохранить
uz_cyrl: Сақлаш
uz_latn: Saqlash

# pinSetupCancel
source: Cancel
ru: Отмена
uz_cyrl: Бекор қилиш
uz_latn: Bekor qilish

# pinSetupErrorLength
source: PIN must be 4 digits.
ru: PIN должен быть из 4 цифр.
uz_cyrl: PIN 4 та рақам бўлиши керак.
uz_latn: PIN 4 ta raqam bo'lishi kerak.

# pinSetupErrorMismatch
source: PINs do not match.
ru: PIN не совпадает.
uz_cyrl: PIN лар мос эмас.
uz_latn: PIN lar mos emas.

# pinUnlockTitle
source: Enter PIN
ru: Введите PIN
uz_cyrl: PIN киритинг
uz_latn: PIN kiriting

# pinUnlockSubtitle
source: Enter your PIN to continue.
ru: Введите PIN, чтобы продолжить.
uz_cyrl: Давом этиш учун PIN киритинг.
uz_latn: Davom etish uchun PIN kiriting.

# pinUnlockButton
source: Unlock
ru: Открыть
uz_cyrl: Кириш
uz_latn: Kirish

# pinUnlockError
source: Incorrect PIN.
ru: Неверный PIN.
uz_cyrl: PIN нотўғри.
uz_latn: PIN noto'g'ri.

# biometricButton
source: Use biometrics
ru: Использовать биометрию
uz_cyrl: Биометрик кириш
uz_latn: Biometrik kirish

# biometricReason
source: Authenticate to unlock.
ru: Подтвердите личность для входа.
uz_cyrl: Кириш учун тасдиқланг.
uz_latn: Kirish uchun tasdiqlang.

# biometricUnavailable
source: Biometrics not available on this device.
ru: Биометрия недоступна на этом устройстве.
uz_cyrl: Бу қурилмада биометрик мавжуд эмас.
uz_latn: Bu qurilmada biometrik mavjud emas.

# biometricFailed
source: Biometric authentication failed.
ru: Не удалось пройти биометрическую проверку.
uz_cyrl: Биометрик текширув муваффақиятсиз.
uz_latn: Biometrik tekshiruv muvaffaqiyatsiz.

# changePinButton
source: Change PIN
ru: Изменить PIN
uz_cyrl: PIN кодни ўзгартириш
uz_latn: PIN kodni o'zgartirish

# changePinTitle
source: Change PIN
ru: Изменить PIN
uz_cyrl: PIN кодни ўзгартириш
uz_latn: PIN kodni o'zgartirish

# pinChangeOldLabel
source: Enter current PIN
ru: Введите текущий PIN
uz_cyrl: Жорий PIN кодни киритинг
uz_latn: Joriy PIN kodni kiriting

# pinChangeNewLabel
source: Enter new PIN
ru: Введите новый PIN
uz_cyrl: Янги PIN кодни киритинг
uz_latn: Yangi PIN kodni kiriting

# pinChangeSuccess
source: PIN changed successfully.
ru: PIN успешно изменён.
uz_cyrl: PIN код муваффақиятли ўзгартирилди.
uz_latn: PIN kod muvaffaqiyatli o'zgartirildi.

# pinChangeError
source: Failed to change PIN. Check your current PIN.
ru: Не удалось изменить PIN. Проверьте текущий PIN.
uz_cyrl: PIN кодни ўзгартириб бўлмади. Жорий PIN кодни текширинг.
uz_latn: PIN kodni o'zgartirib bo'lmadi. Joriy PIN kodni tekshiring.

# pinChangeSameError
source: New PIN must be different from current PIN.
ru: Новый PIN должен отличаться от текущего.
uz_cyrl: Янги PIN код жорий PIN коддан фарқли бўлиши керак.
uz_latn: Yangi PIN kod joriy PIN koddan farqli bo'lishi kerak.

# courierServiceTitle
source: Courier Service Statement
ru: Отчёт по курьерским услугам
uz_cyrl: Курерлик хизмати бўйича ҳисоб китоб

# courierServiceSelectRange
source: Select date range
ru: Выберите период
uz_cyrl: Даврни танланг

# courierServiceSelectButton
source: Select period
ru: Выбрать период
uz_cyrl: Даврни танлаш

# courierServiceSelectPrompt
source: Please select a date range to view the report.
ru: Пожалуйста, выберите период для просмотра отчёта.
uz_cyrl: Ҳисоботни кўриш учун даврни танланг.

# courierServiceStartBalance
source: Opening balance
ru: Начальный баланс
uz_cyrl: Бошланғич баланс

# courierServiceEndBalance
source: Closing balance
ru: Конечный баланс
uz_cyrl: Якуний баланс

# courierServiceOperationsTitle
source: Service operations
ru: Операции по услугам
uz_cyrl: Хизмат операциялари

# courierServiceOrderNumber
source: Order number
ru: Номер заказа
uz_cyrl: Буюртма рақами

# courierServiceCharged
source: Charged
ru: Начислено
uz_cyrl: Ҳисобланди

# courierServicePaid
source: Paid
ru: Оплачено
uz_cyrl: Тўланди

# courierServiceCount
source: Service count
ru: Количество воды
uz_cyrl: Сув сони
