Repository: Shohjahon-n/suv_kerak_courier
Catalog: lib/l10n/app_*.arb
Languages: ru, uz_cyrl, uz_latn

# homeTitle
source: Courier Dashboard
ru: Панель курьера
uz_cyrl: Курер панели
uz_latn: Kuryer paneli

# homeSubtitle
source: Ready for courier feature development.
ru: Готово для разработки функций курьера.
uz_cyrl: Курер функцияларини ишлаб чиқишга тайёр.
uz_latn: Kuryer funksiyalarini ishlab chiqishga tayyor.

# counterLabel
source: Counter
ru: Счётчик
uz_cyrl: Ҳисоблагич
uz_latn: Hisoblagich

source: Open settings
ru: Открыть настройки
uz_cyrl: Созламаларни очиш
uz_latn: Sozlamalarni ochish

# themeLight
source: Switch to light theme
ru: Переключить на светлую тему
uz_cyrl: Ёруғ мавзуга ўтиш
uz_latn: Yorug' mavzuga o'tish

# themeDark
source: Switch to dark theme
ru: Переключить на тёмную тему
uz_cyrl: Қоронғи мавзуга ўтиш
uz_latn: Qorong'i mavzuga o'tish

# settingsTitle
source: Settings
ru: Настройки
uz_cyrl: Созламалар
uz_latn: Sozlamalar

# profileTitle
source: Profile
ru: Профиль
uz_cyrl: Профил
uz_latn: Profil

# languageTitle
source: Language
ru: Язык
uz_cyrl: Тил
uz_latn: Til

# languageEnglish
source: English
ru: Английский
uz_cyrl: Инглизча
uz_latn: Inglizcha

# languageRussian
source: Russian
ru: Русский
uz_cyrl: Русча
uz_latn: Ruscha

# languageUzbekLatin
source: Uzbek (Latin)
ru: Узбекский (латиница)
uz_cyrl: Ўзбек (Лотин)
uz_latn: O'zbek (Lotin)

# languageUzbekCyrillic
source: Uzbek (Cyrillic)
ru: Узбекский (кириллица)
uz_cyrl: Ўзбек (Кирил)
uz_latn: O'zbek (Kiril)

# languageSelectionTitle
source: Choose your language
ru: Выберите язык
uz_cyrl: Тилни танланг
uz_latn: Tilni tanlang

# languageSelectionSubtitle
source: Select the language for the courier app.
ru: Выберите язык для приложения курьера.
uz_cyrl: Курер иловаси учун тилни танланг.
uz_latn: Kuryer ilovasi uchun tilni tanlang.

# loginTitle
source: Courier Login
ru: Вход курьера
uz_cyrl: Курер кириш
uz_latn: Kuryer kirish

# loginSubtitle
source: Sign in to start deliveries.
ru: Войдите, чтобы начать доставки.
uz_cyrl: Етказиб беришни бошлаш учун тизимга киринг.
uz_latn: Yetkazib berishni boshlash uchun tizimga kiring.

# loginPlaceholder
source: Login screen is being prepared.
ru: Экран входа в разработке.
uz_cyrl: Кириш саҳифаси тайёрланмоқда.
uz_latn: Kirish sahifasi tayyorlanmoqda.

# loginHint
source: We'll add phone and verification next.
ru: Далее добавим телефон и подтверждение.
uz_cyrl: Кейинги босқичда телефон ва тасдиқлаш бўлади.
uz_latn: Keyingi bosqichda telefon va tasdiqlash bo'ladi.

# loginCourierIdLabel
source: Courier ID
ru: ID курьера
uz_cyrl: Курер ID
uz_latn: Kuryer ID

# loginCourierIdHint
source: Enter your courier ID
ru: Введите ID курьера
uz_cyrl: Курер ID ни киритинг
uz_latn: Kuryer ID ni kiriting

# loginPasswordLabel
source: Password
ru: Пароль
uz_cyrl: Парол
uz_latn: Parol

# loginPasswordHint
source: Enter your password
ru: Введите пароль
uz_cyrl: Паролни киритинг
uz_latn: Parolni kiriting

# loginButton
source: Log in
ru: Войти
uz_cyrl: Кириш
uz_latn: Kirish

source: Forgot password?
ru: Забыли пароль?
uz_cyrl: Паролни унутдингизми?
uz_latn: Parolni unutdingizmi?

# forgotPasswordTitle
source: Update password
ru: Обновить пароль
uz_cyrl: Паролни янгилаш
uz_latn: Parolni yangilash

# forgotPasswordSubtitle
source: Enter your courier ID to receive a code.
ru: Введите ID курьера, чтобы получить код.
uz_cyrl: Курер ID ни киритинг ва код олинг.
uz_latn: Kuryer ID ni kiriting va kodni oling.

# forgotPasswordCourierIdLabel
source: Courier ID
ru: ID курьера
uz_cyrl: Курер ID
uz_latn: Kuryer ID

# forgotPasswordCourierIdHint
source: Enter your courier ID
ru: Введите ID курьера
uz_cyrl: Курер ID ни киритинг
uz_latn: Kuryer ID ni kiriting

# forgotPasswordStartButton
source: Update password
ru: Обновить пароль
uz_cyrl: Паролни янгилаш
uz_latn: Parolni yangilash

# forgotPasswordValidationEmpty
source: Enter your courier ID.
ru: Введите ID курьера.
uz_cyrl: Курер ID ни киритинг.
uz_latn: Kuryer ID ni kiriting.

# forgotPasswordStartSuccess
source: Code sent. Check the bot.
ru: Код отправлен. Проверьте бота.
uz_cyrl: Код юборилди. Ботни текширинг.
uz_latn: Kod yuborildi. Botni tekshiring.

# forgotPasswordStartFailed
source: Failed to send the code.
ru: Не удалось отправить код.
uz_cyrl: Код юборилмади.
uz_latn: Kod yuborilmadi.

# forgotPasswordOtpTitle
source: Enter code
ru: Введите код
uz_cyrl: Кодни киритинг
uz_latn: Kodni kiriting

# forgotPasswordOtpSubtitle
source: Enter the 4-digit code sent by the bot.
ru: Введите 4-значный код из бота.
uz_cyrl: Ботдан келган 4 хонали кодни киритинг.
uz_latn: Botdan kelgan 4 xonali kodni kiriting.

# forgotPasswordOtpLabel
source: OTP code
ru: Код OTP
uz_cyrl: OTP коди
uz_latn: OTP kodi

# forgotPasswordOtpHint
source: 4-digit code
ru: 4-значный код
uz_cyrl: 4 хонали код
uz_latn: 4 xonali kod

# forgotPasswordOtpButton
source: Verify
ru: Подтвердить
uz_cyrl: Тасдиқлаш
uz_latn: Tasdiqlash

# forgotPasswordOtpValidation
source: Enter the 4-digit code.
ru: Введите 4-значный код.
uz_cyrl: 4 хонали кодни киритинг.
uz_latn: 4 xonali kodni kiriting.

# forgotPasswordOtpFailed
source: OTP verification failed.
ru: Не удалось подтвердить код.
uz_cyrl: Код текшируви муваффақиятсиз.
uz_latn: Kod tekshiruvi muvaffaqiyatsiz.

# forgotPasswordOpenBotButton
source: Go to bot
ru: Перейти в бота
uz_cyrl: Ботга ўтиш
uz_latn: Botga o'tish

# forgotPasswordOpenBotFailed
source: Unable to open the bot.
ru: Не удалось открыть бота.
uz_cyrl: Ботни очиб бўлмади.
uz_latn: Botni ochib bo'lmadi.

# registerLink
source: Register
ru: Регистрация
uz_cyrl: Рўйхатдан ўтиш
uz_latn: Ro'yxatdan o'tish

# loginValidationEmpty
source: Enter ID and password.
ru: Введите ID и пароль.
uz_cyrl: ID ва паролни киритинг.
uz_latn: ID va parolni kiriting.

# loginValidationId
source: Courier ID must be numbers.
ru: ID курьера должен быть числом.
uz_cyrl: Курер ID фақат рақам бўлиши керак.
uz_latn: Kuryer ID faqat raqam bo'lishi kerak.

# loginErrorGeneric
source: Login failed. Try again.
ru: Не удалось войти. Попробуйте еще раз.
uz_cyrl: Киришда хатолик. Қайта уриниб кўринг.
uz_latn: Kirishda xatolik. Qayta urinib ko'ring.

# loginSuccess
source: Logged in successfully.
ru: Успешный вход.
uz_cyrl: Муваффақиятли кирдингиз.
uz_latn: Muvaffaqiyatli kirdingiz.

source: Coming soon.
ru: Скоро будет.
uz_cyrl: Тез орада.
uz_latn: Tez orada.

# refreshLabel
source: Refresh
ru: Обновить
uz_cyrl: Янгилаш
uz_latn: Yangilash

# commonYes
source: Yes
ru: Да
uz_cyrl: Ҳа
uz_latn: Ha

# commonNo
source: No
ru: Нет
uz_cyrl: Йўқ
uz_latn: Yo'q

# commonBack
source: Back
ru: Назад
uz_cyrl: Орқага
uz_latn: Orqaga

# homeEmptyState
source: No data yet.
ru: Пока нет данных.
uz_cyrl: Ҳозирча маълумот йўқ.
uz_latn: Hozircha ma'lumot yo'q.

# homeCourierIdLabel
source: Courier ID
ru: ID курьера
uz_cyrl: Курер ID
uz_latn: Kuryer ID

# homeLastActiveLabel
source: Last active
ru: Последняя активность
uz_cyrl: Охирги фаоллик
uz_latn: Oxirgi faollik

# homeCashBalanceLabel
source: Cash balance
ru: Остаток в кассе
uz_cyrl: Касса қолдиғи
uz_latn: Kassa qoldig'i

# homeFullWaterLabel
source: Full water remaining
ru: Полная вода
uz_cyrl: Тўла сув қолдиғи
uz_latn: To'la suv qoldig'i

# homeEmptyBottleLabel
source: Empty bottles
ru: Пустые бутыли
uz_cyrl: Бўш баклар
uz_latn: Bo'sh baklar

# homeOrdersTodayLabel
source: Completed today
ru: Выполнено сегодня
uz_cyrl: Бугун бажарилган буюртмалар
uz_latn: Bugungi buyurtmalar

source: Not available
ru: Нет данных
uz_cyrl: Маълумот йўқ
uz_latn: Ma'lumot yo'q

# mainMenuTitle
source: Main menu
ru: Главное меню
uz_cyrl: Асосий меню
uz_latn: Asosiy menyu

# menuCourierService
source: Courier service accounting
ru: Расчеты по курьерской службе
uz_cyrl: Курерлик хизмати бўйича ҳисоб китоб

# menuOrders
source: Orders
ru: Заказы
uz_cyrl: Буюртмалар
uz_latn: Buyurtmalar

# ordersQuickActionsTitle
source: Quick actions
ru: Быстрые действия
uz_cyrl: Тезкор амаллар
uz_latn: Tezkor amallar

# ordersPendingButton
source: Uncompleted orders
ru: Невыполненные заказы
uz_cyrl: Бажарилмаган буюртмалар
uz_latn: Bajarilmagan buyurtmalar

# ordersCompletedTodayButton
source: Today's completed orders
ru: Выполненные за сегодня
uz_cyrl: Бугунги бажарилган буюртмалар
uz_latn: Bugungi bajarilgan buyurtmalar

# ordersMapButton
source: Show orders on map
ru: Показать заказы на карте
uz_cyrl: Буюртмаларни харитада кўрсатиш
uz_latn: Buyurtmalarni xaritada ko'rsatish

# ordersPeriodicReportTitle
source: Periodic completed orders report
ru: Периодический отчет по выполненным заказам
uz_cyrl: Бажарилган буюртмаларни даврий ҳисоботи
uz_latn: Bajarilgan buyurtmalarni davriy hisoboti

# ordersPendingTitle
source: Uncompleted orders
ru: Невыполненные заказы
uz_cyrl: Бажарилмаган буюртмалар
uz_latn: Bajarilmagan buyurtmalar

# ordersSummaryTitle
source: Summary
ru: Сводка
uz_cyrl: Умумий маълумот
uz_latn: Umumiy ma'lumot

# ordersCountLabel
source: Orders count
ru: Количество заказов
uz_cyrl: Буюртмалар сони
uz_latn: Buyurtmalar soni

# ordersTotalWaterLabel
source: Total water
ru: Всего воды
uz_cyrl: Жами сув сони
uz_latn: Jami suv soni

# ordersOrderIdLabel
source: Order number
ru: Номер заказа
uz_cyrl: Буюртма рақами
uz_latn: Buyurtma raqami

# ordersBuyerIdLabel
source: Buyer ID
ru: ID покупателя
uz_cyrl: Буюртмачи ID
uz_latn: Buyurtmachi ID

# ordersNoteLabel
source: Note
ru: Комментарий
uz_cyrl: Изоҳ
uz_latn: Izoh

# ordersWaterCountLabel
source: Water count
ru: Количество воды
uz_cyrl: Сув сони
uz_latn: Suv soni

# ordersPaymentStatusLabel
source: Payment status
ru: Статус оплаты
uz_cyrl: Тўлов ҳолати
uz_latn: To'lov holati

# ordersLocationLabel
source: Location
ru: Локация
uz_cyrl: Локация
uz_latn: Lokatsiya

# ordersAddressLabel
source: Address
ru: Адрес
uz_cyrl: Манзил

# ordersEmptyState
source: No orders yet.
ru: Пока нет заказов.
uz_cyrl: Ҳозирча буюртмалар йўқ.
uz_latn: Hozircha buyurtmalar yo'q.

# ordersSessionMissing
source: Business ID not found.
ru: Не найден ID бизнеса.
uz_cyrl: Бизнес ID топилмади.
uz_latn: Biznes ID topilmadi.

# ordersLoadFailed
source: Failed to load orders.
ru: Не удалось загрузить заказы.
uz_cyrl: Буюртмаларни юклашда хатолик.
uz_latn: Buyurtmalarni yuklashda xatolik.

# ordersLocationServiceDisabled
source: Location services are disabled.
ru: Службы геолокации отключены.
uz_cyrl: Жойлашув хизмати ўчирилган.
uz_latn: Joylashuv xizmati o'chirilgan.

# ordersLocationPermissionDenied
source: Location permission is required to show your position.
ru: Разрешение на геолокацию нужно, чтобы показать вашу позицию.
uz_cyrl: Жойлашувингизни кўрсатиш учун рухсат керак.
uz_latn: Joylashuvingizni ko'rsatish uchun ruxsat kerak.

# ordersLocationPermissionPermanentlyDenied
source: Enable location permission in settings to show your position.
ru: Разрешите доступ к геолокации в настройках, чтобы показать вашу позицию.
uz_cyrl: Жойлашув рухсатини созламалардан ёқинг.
uz_latn: Joylashuv ruxsatini sozlamalardan yoqing.

# ordersLocationUnavailable
source: Unable to get your location.
ru: Не удалось получить вашу геолокацию.
uz_cyrl: Жойлашувни аниқлаб бўлмади.
uz_latn: Joylashuvni aniqlab bo'lmadi.

# ordersCourierLabel
source: You
ru: Вы
uz_cyrl: Сиз
uz_latn: Siz

# ordersCourierTitle
source: Your location
ru: Ваше местоположение
uz_cyrl: Сизнинг жойлашувингиз
uz_latn: Sizning joylashuvingiz

# ordersCourierSubtitle
source: Showing your current position.
ru: Показываем вашу текущую позицию.
uz_cyrl: Ҳозирги жойлашувингиз кўрсатилади.
uz_latn: Hozirgi joylashuvingiz ko'rsatiladi.

# ordersMapFindMe
source: Find me
ru: Мое местоположение
uz_cyrl: Менинг жойлашувим
uz_latn: Mening joylashuvim

# ordersMapGoButton
source: Go
ru: Маршрут
uz_cyrl: Йўналиш
uz_latn: Yo'nalish

# ordersRouteFailed
source: Failed to build route.
ru: Не удалось построить маршрут.
uz_cyrl: Маршрутни чизиб бўлмади.
uz_latn: Marshrutni chizib bo'lmadi.

# ordersMapFollowHeading
source: Follow heading
ru: Следовать направлению
uz_cyrl: Йўналишни кузатиш
uz_latn: Yo'nalishni kuzatish

# ordersMapFollowHeadingOff
source: Stop following
ru: Отключить слежение
uz_cyrl: Кузатишни ўчириш
uz_latn: Kuzatishni o'chirish

# ordersMapNavigationTitle
source: Navigation
ru: Навигация
uz_cyrl: Навигация
uz_latn: Navigatsiya

# ordersMapUpdatingRoute
source: Updating route...
ru: Маршрут обновляется...
uz_cyrl: Йўналиш янгиланмоқда...
uz_latn: Yo'nalish yangilanmoqda...

# ordersMapStopButton
source: Stop
ru: Остановить
uz_cyrl: Тўхтатиш
uz_latn: To'xtatish

# ordersMapUnitKilometer
source: km
ru: км
uz_cyrl: км

# ordersMapUnitMeter
source: m
ru: м
uz_cyrl: м

# ordersMapUnitMinute
source: min
ru: мин
uz_cyrl: дақ
uz_latn: daq

# ordersMapUnitHour
source: h
ru: ч
uz_cyrl: соат
uz_latn: soat

# ordersMapTitle
source: Map view
ru: Карта
uz_cyrl: Харитада кўриш
uz_latn: Xaritada ko'rish

# ordersMapOnWayOrderLoadFailed
source: Failed to load the active order.
ru: Не удалось загрузить активный заказ.
uz_cyrl: Йўлда турган буюртмани юклашда хатолик.
uz_latn: Yo'lda turgan buyurtmani yuklashda xatolik.

# ordersMapArrivedHintFailed
source: Failed to send arrival notification.
ru: Не удалось отправить уведомление о прибытии.
uz_cyrl: Етиб келиш хабарини юборишда хатолик.
uz_latn: Yetib kelish xabarini yuborishda xatolik.

# ordersMapSetOnWayFailed
source: Failed to mark the order as on the way.
ru: Не удалось отметить заказ как в пути.
uz_cyrl: Йўлга чиққан ҳолатини белгилашда хатолик.
uz_latn: Yo'lga chiqqan holatini belgilashda xatolik.

# ordersMapOrderDetailsLoadFailed
source: Failed to load order details.
ru: Не удалось загрузить данные заказа.
uz_cyrl: Буюртма маълумотларини юклашда хатолик.
uz_latn: Buyurtma ma'lumotlarini yuklashda xatolik.

# ordersMapCompleteOrderFailed
source: Failed to complete the order.
ru: Не удалось завершить заказ.
uz_cyrl: Буюртмани якунлашда хатолик.
uz_latn: Buyurtmani yakunlashda xatolik.

# ordersMapOpenCallFailed
source: Unable to open the call app.
ru: Не удалось открыть приложение для звонка.
uz_cyrl: Қўнғироқ иловасини очиб бўлмади.
uz_latn: Qo'ng'iroq ilovasini ochib bo'lmadi.

# ordersMapArrivedDialogTitle
source: Have you arrived?
ru: Вы прибыли?
uz_cyrl: Етиб келдингизми?
uz_latn: Yetib keldingizmi?

# ordersMapArrivedAutoClose
source: Closes automatically in {seconds} seconds.
ru: Автоматически закроется через {seconds} сек.
uz_cyrl: {seconds} сониядан кейин автоматик ёпилади
uz_latn: {seconds} soniyadan keyin avtomatik yopiladi

# ordersMapOrderDetailsTitle
source: Order details
ru: Данные заказа
uz_cyrl: Буюртма маълумотлари
uz_latn: Buyurtma ma'lumotlari

# ordersMapWaterPriceLabel
source: Water price
ru: Цена воды
uz_cyrl: Сув нархи
uz_latn: Suv narxi

# ordersMapWaterLabel
source: Water
ru: Вода
uz_cyrl: Сув
uz_latn: Suv

# ordersMapSoldBottleLabel
source: Sold containers
ru: Продано тары
uz_cyrl: Сотилган тара
uz_latn: Sotilgan tara

# ordersMapTotalLabel
source: Total
ru: Итого
uz_cyrl: Жами
uz_latn: Jami

# ordersMapPaymentAcceptedOnline
source: Accepted (Online payment)
ru: Принято (онлайн оплата)
uz_cyrl: Қабул қилинди (Онлайн тўлов)
uz_latn: Qabul qilindi (Online to'lov)

# ordersMapAcceptPayment
source: Accept payment
ru: Принять оплату
uz_cyrl: Тўловни қабул қилиш
uz_latn: To'lovni qabul qilish

# ordersMapSelectOrder
source: Select an order
ru: Выберите заказ
uz_cyrl: Буюртма танланг
uz_latn: Buyurtma tanlang

# ordersMapTakeOrder
source: Take order {orderNum}
ru: Возьмите заказ {orderNum}
uz_cyrl: Буюртма {orderNum} ни олинг
uz_latn: Buyurtma {orderNum} ni oling

# ordersMapArrivedButton
source: Arrived for order {orderNum}
ru: Прибыл к заказу {orderNum}
uz_cyrl: {orderNum} га етиб келдим
uz_latn: {orderNum} ga yetib keldim

# ordersMapOnWayButton
source: I'm on my way
ru: Я в пути
uz_cyrl: Йўлга чиқдим
uz_latn: Yo'lga chiqdim

# ordersMapFoundButton
source: Found
ru: Нашёл
uz_cyrl: Топилди
uz_latn: Topildi

# ordersMapNotFoundButton
source: Not found
ru: Не нашёл
uz_cyrl: Топилмади
uz_latn: Topilmadi

# ordersMapOrderSummary
source: Order: {orderNum}, Water: {waterCount}
ru: Заказ: {orderNum}, Вода: {waterCount}
uz_cyrl: Буюртма: {orderNum}, Сув: {waterCount}
uz_latn: Buyurtma: {orderNum}, Suv: {waterCount}

# ordersMapConfirmCompletedTitle
source: Completed?
ru: Завершено?
uz_cyrl: Бажарилди?
uz_latn: Bajarildi?

# ordersMapLocationServiceDisabled
source: Location service is disabled
ru: Служба геолокации отключена
uz_cyrl: Жойлашув хизмати ўчирилган
uz_latn: Joylashuv xizmati o'chirilgan

# ordersMapLocationPermissionDenied
source: Location permission denied
ru: Разрешение на геолокацию отклонено
uz_cyrl: Жойлашув рухсати берилмади
uz_latn: Joylashuv ruxsati berilmadi

# ordersMapLocationPermissionDeniedForever
source: Location permission denied forever (enable in Settings)
ru: Разрешение на геолокацию навсегда отклонено (включите в Настройках)
uz_cyrl: Жойлашув рухсати бутунлай блокланган (Созламалардан ёқинг)
uz_latn: Joylashuv ruxsati butunlay bloklangan (Sozlamalardan yoqing)

# ordersMapSessionError
source: Session not found
ru: Сессия не найдена
uz_cyrl: Сессия топилмади
uz_latn: Sessiya topilmadi

# ordersMapUrlNotFound
source: Map URL not found
ru: URL карты не найден
uz_cyrl: Харита URL топилмади
uz_latn: Xarita URL topilmadi

# ordersMapLoadError
source: Failed to load map
ru: Не удалось загрузить карту
uz_cyrl: Харитани юклаш муваффақиятсиз
uz_latn: Xaritani yuklash muvaffaqiyatsiz

# menuCashReport
source: Cash report
ru: Кассовый отчет
uz_cyrl: Касса ҳисоботи
uz_latn: Kassa hisoboti

# menuBottleBalance
source: Water and Bottle Balance
ru: Количество воды и учет тары
uz_cyrl: Сувлар сони ва таралар ҳисоби
uz_latn: Taralar hisobi

# bottleBalanceEmptyPeriodicTitle
source: Periodic empty bottle report
ru: Периодический учет тары
uz_cyrl: Таралар даврий ҳисоби
uz_latn: Taralar davriy hisobi

# bottleBalanceFullWaterPeriodicTitle
source: Periodic full water report
ru: Периодический учет полных бутылей
uz_cyrl: Сув тўла баклар даврий ҳисоби
uz_latn: Suv to'la baklar davriy hisobi

# bottleBalanceSummaryTitle
source: Summary
ru: Сводка
uz_cyrl: Якун
uz_latn: Yakun

# bottleBalanceOperationsTitle
source: Operations
ru: Операции
uz_cyrl: Операциялар
uz_latn: Operatsiyalar

# bottleBalanceOpeningBalanceLabel
source: Opening bottle balance
ru: Начальный остаток тары
uz_cyrl: Бошланғич тара қолдиғи
uz_latn: Boshlang'ich tara qoldig'i

# bottleBalanceClosingBalanceLabel
source: Closing bottle balance
ru: Конечный остаток тары
uz_cyrl: Якуний тара қолдиғи
uz_latn: Yakuniy tara qoldig'i

# bottleBalanceTotalIncomeLabel
source: Total bottles in
ru: Поступило тары
uz_cyrl: Жами тара кирими
uz_latn: Jami tara kirimi

# bottleBalanceTotalExpenseLabel
source: Total bottles out
ru: Расход тары
uz_cyrl: Жами тара чиқими
uz_latn: Jami tara chiqimi

# bottleBalanceIncomeLabel
source: In
ru: Приход
uz_cyrl: Кирим
uz_latn: Kirim

# bottleBalanceExpenseLabel
source: Out
ru: Расход
uz_cyrl: Чиқим
uz_latn: Chiqim

# bottleBalanceBalanceLabel
source: Balance
ru: Остаток
uz_cyrl: Қолдиқ
uz_latn: Qoldiq

# fullWaterOpeningBalanceLabel
source: Opening full water balance
ru: Начальный остаток полных бутылей
uz_cyrl: Бошланғич сув тўла баклар қолдиғи
uz_latn: Boshlang'ich suv to'la baklar qoldig'i

# fullWaterClosingBalanceLabel
source: Closing full water balance
ru: Конечный остаток полных бутылей
uz_cyrl: Якуний сув тўла баклар қолдиғи
uz_latn: Yakuniy suv to'la baklar qoldig'i

# fullWaterTotalIncomeLabel
source: Total full water in
ru: Поступило полных бутылей
uz_cyrl: Жами сув тўла баклар кирими
uz_latn: Jami suv to'la baklar kirimi

# fullWaterTotalExpenseLabel
source: Total full water out
ru: Расход полных бутылей
uz_cyrl: Жами сув тўла баклар чиқими
uz_latn: Jami suv to'la baklar chiqimi

# menuSettings
source: Settings
ru: Настройки
uz_cyrl: Созламалар
uz_latn: Sozlamalar

# menuSecurity
source: Security
ru: Безопасность
uz_cyrl: Хавфсизлик
uz_latn: Xavfsizlik

# menuAbout
source: About system
ru: О системе
uz_cyrl: Тизим ҳақида
uz_latn: Tizim haqida

# aboutDescription
source: "Suv Kerak" is a professional courier application, part of the "Hisob" business automation platform. Our company specializes in digitalization and automation of business processes for entrepreneurs in various industries. This app helps water distribution businesses streamline order management, delivery tracking, and financial reporting with modern technology solutions.
ru: "Suv Kerak" — профессиональное курьерское приложение в составе платформы автоматизации бизнеса "Hisob". Наша компания специализируется на цифровизации и автоматизации бизнес-процессов для предпринимателей различных отраслей. Это приложение помогает бизнесу по доставке воды оптимизировать управление заказами, отслеживание доставок и финансовую отчётность с помощью современных технологий.
uz_cyrl: "Suv Kerak" — "Hisob" бизнес автоматлаштириш платформасининг профессионал курер иловаси. Компаниямиз турли соҳалардаги тадбиркорлар учун бизнес жараёнларини рақамлаштириш ва автоматлаштириш бўйича ихтисослашган. Бу илова сув етказиб бериш бизнесига буюртмаларни бошқариш, етказиб беришни кузатиш ва молиявий ҳисоботларни замонавий технологиялар ёрдамида соддалаштиради.
uz_latn: "Suv kerak" loyihasi ilovasi "Hisob" tizimidagi ilova bo'lib, aynan ichimlik suvi tarqatish faoliyati bilan shug'ullanuvchi tadbirkorlar uchun buyurtmalarni bajarish jarayonini nazorat qilish maqsadida yaratilgan. Tadbirkorlikning boshqa faoliyatlari yoki aynan sizning faoliyatingizni avtomatlashtirish uchun biz doimo tayyormiz.

# aboutShareButton
source: Share
ru: Отправить
uz_cyrl: Улашиш
uz_latn: Ilovani bo'lishish

# aboutUpdateButton
source: Update
ru: Обновить
uz_cyrl: Янгилаш
uz_latn: Ilovani yangilash

# aboutVersionLabel
source: Version
ru: Версия
uz_cyrl: Версия
uz_latn: Versiya

# aboutShareMessage
source: Try the Suv Kerak Courier app.
ru: Попробуйте приложение Suv Kerak Courier.
uz_cyrl: Suv Kerak Courier иловасини синаб кўринг.
uz_latn: Suv Kerak Courier ilovasini sinab ko'ring.

# aboutUpdateUnavailable
source: Update link not available.
ru: Ссылка для обновления недоступна.
uz_cyrl: Янгилаш ҳаволаси мавжуд эмас.
uz_latn: Yangilash havolasi mavjud emas.

# aboutShareUnavailable
source: Share link not available.
ru: Ссылка для отправки недоступна.
uz_cyrl: Улашиш ҳаволаси мавжуд эмас.
uz_latn: Ulashish havolasi mavjud emas.

# homeDevelopedBy
source: Developed by Hisob Company v{version}
ru: Разработано компанией Hisob v{version}
uz_cyrl: Hisob компанияси томонидан ишлаб чиқилди v{version}

# cashReportPeriodicTitle
source: Periodic cash report
ru: Периодический кассовый отчет
uz_cyrl: Даврий касса ҳисоботи
uz_latn: Davriy kassa hisoboti

# cashReportOnlineTitle
source: Online payments
ru: Онлайн платежи
uz_cyrl: Онлайн тўловлар
uz_latn: Onlayn to'lovlar

# cashReportStartDate
source: Start date
ru: Дата начала
uz_cyrl: Бошланиш санаси
uz_latn: Boshlanish sanasi

# cashReportEndDate
source: End date
ru: Дата окончания
uz_cyrl: Тугаш санаси
uz_latn: Tugash sanasi

# cashReportPickDate
source: Select date
ru: Выберите дату
uz_cyrl: Санани танланг
uz_latn: Sanani tanlang

# cashReportShow
source: Show
ru: Показать
uz_cyrl: Кўрсатиш
uz_latn: Ko'rsatish

# cashReportValidationRequired
source: Select start and end dates.
ru: Выберите дату начала и окончания.
uz_cyrl: Бошланиш ва тугаш санасини танланг.
uz_latn: Boshlanish va tugash sanasini tanlang.

# cashReportValidationOrder
source: Start date must be before end date.
ru: Дата начала должна быть раньше даты окончания.
uz_cyrl: Бошланиш санаси тугаш санасидан олдин бўлиши керак.
uz_latn: Boshlanish sanasi tugash sanasidan oldin bo'lishi kerak.

# cashReportRangeLabel
source: Period
ru: Период
uz_cyrl: Давр
uz_latn: Davr

# cashReportApiNotReady
source: API is not connected yet.
ru: API еще не подключен.
uz_cyrl: API ҳали уланмаган.
uz_latn: API hali ulanmagan.

# cashReportEmptyResult
source: No data for the selected period.
ru: Нет данных за выбранный период.
uz_cyrl: Танланган давр учун маълумот йўқ.
uz_latn: Tanlangan davr uchun ma'lumot yo'q.
